; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite7 - satellite
	instrument14 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	image0 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 thermograph1)
	(supports instrument4 spectrograph2)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument6 spectrograph2)
	(supports instrument6 image0)
	(calibration_target instrument6 Star1)
	(supports instrument7 spectrograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
	(supports instrument8 thermograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 thermograph1)
	(supports instrument9 image0)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 Star3)
	(supports instrument10 image0)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star10)
	(supports instrument11 spectrograph2)
	(supports instrument11 thermograph1)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation5)
	(calibration_target instrument11 Star2)
	(supports instrument12 image0)
	(calibration_target instrument12 Star1)
	(supports instrument13 thermograph1)
	(supports instrument13 image0)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 Star2)
	(calibration_target instrument13 Star1)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation5)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 Star3)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star9)
)
(:goal (and
	(pointing satellite5 Planet12)
	(pointing satellite6 Planet12)
	(pointing satellite7 Star8)
	(have_image Planet6 spectrograph2)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 spectrograph2)
	(have_image Star9 image0)
	(have_image Star10 spectrograph2)
	(have_image Planet11 image0)
	(have_image Planet12 spectrograph2)
))

)

; plan
1. (turn_to satellite7 star8 star9)
   deleted: (pointing satellite7 star9)
   added: (pointing satellite7 star8)
   goals met: 1 of 10
2. (switch_on instrument11 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument11)
   goals met: 1 of 10
3. (calibrate satellite6 instrument11 groundstation5)
   added: (calibrated instrument11)
   goals met: 1 of 10
4. (turn_to satellite6 planet6 groundstation5)
   deleted: (pointing satellite6 groundstation5)
   added: (pointing satellite6 planet6)
   goals met: 1 of 10
5. (take_image satellite6 planet6 instrument11 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 2 of 10
6. (turn_to satellite6 planet11 planet6)
   deleted: (pointing satellite6 planet6)
   added: (pointing satellite6 planet11)
   goals met: 2 of 10
7. (take_image satellite6 planet11 instrument11 image0)
   added: (have_image planet11 image0)
   goals met: 3 of 10
8. (turn_to satellite6 phenomenon7 planet11)
   deleted: (pointing satellite6 planet11)
   added: (pointing satellite6 phenomenon7)
   goals met: 3 of 10
9. (turn_to satellite5 planet12 star10)
   deleted: (pointing satellite5 star10)
   added: (pointing satellite5 planet12)
   goals met: 4 of 10
10. (take_image satellite6 phenomenon7 instrument11 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 5 of 10
11. (turn_to satellite6 star10 phenomenon7)
   deleted: (pointing satellite6 phenomenon7)
   added: (pointing satellite6 star10)
   goals met: 5 of 10
12. (take_image satellite6 star10 instrument11 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 6 of 10
13. (turn_to satellite6 star8 star10)
   deleted: (pointing satellite6 star10)
   added: (pointing satellite6 star8)
   goals met: 6 of 10
14. (take_image satellite6 star8 instrument11 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 7 of 10
15. (turn_to satellite6 star9 star8)
   deleted: (pointing satellite6 star8)
   added: (pointing satellite6 star9)
   goals met: 7 of 10
16. (take_image satellite6 star9 instrument11 image0)
   added: (have_image star9 image0)
   goals met: 8 of 10
17. (turn_to satellite6 planet12 star9)
   deleted: (pointing satellite6 star9)
   added: (pointing satellite6 planet12)
   goals met: 9 of 10
18. (take_image satellite6 planet12 instrument11 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 10 of 10
